      *> { dg-do compile }

00002  PROGRAM-ID.      PROG.                                           RJD0002
00003  PROCEDURE        DIVISION.                                       RJD0003
00004      GOBACK.                                                      RJD0004
00005  END PROGRAM      PROG.                                           RJD0005

